In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/sales.csv')
df

   customer_id customer_name region product  revenue        date
0            1          Amit   West  Laptop    55000  2024-01-15
1            2          Riya  North   Phone    25000  2024-01-18
2            3          John  South  Tablet    18000  2024-02-05
3            4          Sara   West  Laptop    62000  2024-02-20
4            5           Ali   East   Phone    27000  2024-03-10
5            6          Neha  North  Laptop    59000  2024-03-22
6            7         David  South  Tablet    21000  2024-04-02
7            8         Karan   West   Phone    24000  2024-04-15
8            9         Priya   East  Laptop    61000  2024-05-01
9           10         Arjun  North  Tablet    20000  2024-05-12